In [1]:
import pandas as pd

In [5]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['Male','Female','Female','Male','Male',
                'Female','Female']
               }

In [6]:
df = pd.DataFrame(dict1)

## 1) Display Top 3 Rows of the dataset.

In [7]:
df.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2) Check Last 3 rows of the Dataset.

In [9]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3) Find Shape of our Datset (Number of rows and number of columns).

In [10]:
df.shape

(7, 3)

In [11]:
print("Number of rows", df.shape[0])
print("Number of columns", df.shape[1])

Number of rows 7
Number of columns 3

## 4) Get information about our dataset like total number rows, total number of columns, Datatypes of each column and memory requirement.

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

## 5) Check null values in Dataset

In [15]:
df.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [16]:
df.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [17]:
df.isnull().sum(axis = 1) # rows

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [18]:
df.isnull().sum(axis = 0) # columns

Name      0
Marks     0
Gender    0
dtype: int64

## 6) Get overall statistics about the DataFrame

In [19]:
df.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [20]:
df.describe(include = 'all') # All columns

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## 7) Find the unique values from the Gender Column.

In [25]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 8) Find the number of Unique values from the Gender column.

In [26]:
df['Gender'].nunique() # number of unique values

2

## 9) Display Count of unique values in Gender Column.

In [28]:
df['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## 10) Find the number of students having marks between 90 to 100 (inclusive) using between Method.

In [31]:
df['Marks'] >= 90 # boolean

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [32]:
df[df['Marks'] >= 90] # list of data

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [36]:
(df['Marks'] >= 90) & (df['Marks'] <= 100) # boolean

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [37]:
df[(df['Marks'] >= 90) & (df['Marks'] <= 100)] # list of record

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [39]:
df['Marks'].between(90,100) # boolean

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [40]:
sum(df['Marks'].between(90,100)) # count

4

## 11) Find Average Marks

In [41]:
df['Marks'].mean()

92.14285714285714

In [42]:
df['Marks'].max()

99

In [43]:
df['Marks'].min()

83

## 12) Apply Method

In [77]:
def marks(x):
    return x//2

In [78]:
df['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [86]:
df['Half_Marks'] = df['Marks'].apply(marks)

In [87]:
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [81]:
df['Marks'].apply(lambda x : x / 2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [82]:
df['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13) Map Function

In [88]:
df['Male_Female'] = df['Gender'].map({'Male' : 1, 'Female' : 0})

In [89]:
df

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## 14) Drop the Column(s)

In [90]:
df.drop('Male_Female', axis = 1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [91]:
df.drop(['Male_Female', 'Half_Marks'], axis = 1, inplace = True)

In [92]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 15) Print Name of the columns

In [93]:
df.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [94]:
df.index

RangeIndex(start=0, stop=7, step=1)

## 16) Sort the DataFrame As Per the Marks Column

In [95]:
df.sort_values(by = "Marks")

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [96]:
df.sort_values(by = "Marks", ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [97]:
df.sort_values(by = ['Marks','Gender'], ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## 17) Display Name & Marks of the Female Students

In [99]:
df['Gender'] == 'Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [100]:
df[df['Gender'] == 'Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [101]:
df[df['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [102]:
df[df['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99